SM_для_EDT/src/Documents/впУчетНаработкиОборудования/впУчетНаработкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впУчетНаработкиОборудования</name>
  <registerRecords>InformationRegister.впНаработкаОбъектовРемонта</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаработкаОбъектов</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПоРемонту</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодчиненныеОбъекты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодчиненныйОбъект</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/InformationRegisters/впНаработкаОбъектовРемонта/впНаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впНаработкаОбъектовРемонта</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НовоеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.впОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаработкаПоРемонту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Documents/впУчетНаработкиОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТаблицаДляДвижений = Документы.впУчетНаработкиОборудования.ПодготовитьТаблицуДвижений(Ссылка);
	Движения.впНаработкаОбъектовРемонта.Записывать = Истина;
	
	Для Каждого СтрокаНаработкаОбъектов Из ТаблицаДляДвижений Цикл
		Движение = Движения.впНаработкаОбъектовРемонта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаНаработкаОбъектов);
		Движение.Период = Дата;
		Движение.Активность = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНаработки из НаработкаОбъектов Цикл
		Если  СтрокаНаработки.РаспространятьНаПодчиненных Тогда
			ОчиститьПодчиненныеНаСервере(СтрокаНаработки.ОбъектРемонта);
			ЗаполнитьПодчиненныеНаСервере(СтрокаНаработки.ОбъектРемонта);
		Иначе 
			ОчиститьПодчиненныеНаСервере(СтрокаНаработки.ОбъектРемонта);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПодчиненныеНаСервере(ОбъектРемонта)
	ТаблицаЗаполнения = впОбщиеПроцедурыДокументовТОИР.ПолучитьТаблицуПодчиненныхОР(ОбъектРемонта);
	Для Каждого стрТаб из ТаблицаЗаполнения Цикл
		СтрокаПодч = ПодчиненныеОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПодч, стрТаб);
	КонецЦикла;
КонецПроцедуры

Процедура ОчиститьПодчиненныеНаСервере(ОбъектРемонта)
	СтрокиДляУдаления = ПодчиненныеОбъекты.НайтиСтроки(Новый Структура("Объект", ОбъектРемонта));
	Для Каждого СтрокаДляУдаления из СтрокиДляУдаления Цикл
		ПодчиненныеОбъекты.Удалить(ПодчиненныеОбъекты.Индекс(СтрокаДляУдаления));
	КонецЦикла;
КонецПроцедуры
